Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བའི་ཕྱིར་བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་། མཐའ་ཐམས་ཅད་དང་བྲལ་བ་ཡོངས་སུ་དག་པའི་ཕྱིར།
en: (17) It is the pure and immaculate seal of great love and compassion because it never gives up on anyone.

source: བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (18) It is the pure and immaculate seal that defeats māras and opposing forces because it is pure in being free from all extremes.

source: ཆོས་རྣམས་ཀྱི་རང་བཞིན་ཡོངས་སུ་དག་པའི་ཕྱིར་ཉོན་མོངས་པའི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་དང་།
en: (19) It is the pure and immaculate seal that defeats all the binding forces of habitual afflictions because the nature of phenomena is pure.

source: ཡང་དག་པར་བླངས་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡོངས་སུ་དག་པའི་ཕྱིར་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་རྟོགས་པ་ཡོངས་སུ་དག་པ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་སྟེ།
en: (20) It is the pure and immaculate seal that realizes the gateway to all buddha qualities in a single moment of mind because the effort to complete all that is to be taken up has been purified.

source: བློ་གྲོས་རྒྱ་མཚོ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་སྒོ་ཉི་ཤུ་པོ་དེ་དག་གིས་ཏིང་ངེ་འཛིན་འདི་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་སྟེ།
en: Sāgaramati, it is because of these twenty factors of the immaculate seal that this absorption is called the immaculate seal.

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ནས་ཏིང་ངེ་འཛིན་གང་རབ་ཏུ་འཐོབ་པའི་ཏིང་ངེ་འཛིན་འདི་ནི་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་ཞེས་བྱའོ། །
en: “Sāgaramati, when bodhisattvas sit at the seat of awakening, the absorption that they acquire is called the pristine and immaculate seal.

source: ཏིང་ངེ་འཛིན་འདི་ཐོབ་མ་ཐག་ཏུ་ཤུགས་ཆེན་པོ་མ་འདྲེས་པ་བརྒྱད་འབྱུང་བར་འགྱུར་ཏེ།
en: As soon as they acquire this absorption, they evince eight unique forms of great strength.

source: བརྒྱད་གང་ཞེ་ན།
en: What are these eight?

source: འདི་ལྟ་སྟེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་རྡོ་རྗེར་གནས་པར་འགྱུར་བ་འདི་ནི་ཤུགས་ཆེན་པོ་མ་འདྲེས་པ་འབྱུང་བ་དང་པོའོ། །
en: The first unique great strength is that all the worlds of the trichiliocosm turn into diamond.

source: ཤིང་ལྗོན་པ་ཐམས་ཅད་ལ་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་སྣ་ཚོགས་ཆགས་ཏེ་བྱང་ཆུབ་ཀྱི་ཤིང་ག་ལ་བ་དེ་ལོགས་སུ་འདུད་ཅིང་འདུད་ལ་རབ་ཏུ་འདུད་དེ་མངོན་པར་རབ་ཏུ་འདུད་པར་འགྱུར་བ་དང་།
en: Second, every tree grows various leaves, flowers, and fruits and then leans, bows, and prostrates in the direction of the tree of awakening.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྐད་ཅིག་དེ་ལ་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་གནོད་པར་མི་འགྱུར་བ་དང་།
en: Third, for that moment, no being is harmed by any affliction.

source: ངན་སོང་བའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་སྟེམཐོང་ནས་ཀྱང་བདེ་བ་ཐམས་ཅད་ཀྱིས་ཚིམ་པར་འགྱུར་བ་དང་།
en: Fourth, all beings in the lower realms behold the bodhisattva at the seat of awakening and, seeing him, they are filled with every kind of pleasure.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ཡང་བར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་འོད་ཀྱིས་ཁྱབ་པར་འགྱུར་བ་དང་།
en: Fifth, the space between all the world systems is pervaded with a golden-colored light.

source: ས་གཡོ་བ་ཆེན་པོ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཞིང་སེམས་ཅན་གང་ལའང་རྣམ་པར་གནོད་པར་མི་འགྱུར་བ་དང་།
en: Sixth, the earth shakes violently, yet no being whatsoever is harmed.

source: ཕྱོགས་བཅུ་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཞལ་སྟོན་ཅིང་མི་འཇིགས་པས་དབུགས་འབྱིན་པར་མཛད་དེ
en: Seventh, the blessed buddhas throughout the ten directions show themselves and provide fearless encouragement, saying,

source: དེད་དཔོན་ཆེན་པོ་རྒྱལ་བར་གྱུར་ཅིག །རྒྱལ་བར་གྱུར་ཅིག་ཅེས་གསུང་བརྗོད་པར་འགྱུར་བ་དང་།
en: ‘Great Captain, may you be victorious! May you be victorious!’

source: སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཆུབ་པར་འགྱུར་བ་སྟེ།
en: Eighth, all buddha qualities are realized in a single moment of mind.

source: བློ་གྲོས་རྒྱ་མཚོ་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་ཐོབ་མ་ཐག་ཏུ་ཤུགས་ཆེན་པོ་མ་འདྲེས་པ་བརྒྱད་པོ་དེ་དག་འབྱུང་བར་འགྱུར་རོ། །
en: Sāgaramati, as soon as they acquire this pristine and immaculate absorption seal, they evince these eight unique forms of great strength.

source: འདི་ལྟར་ཏིང་ངེ་འཛིན་འདིའི་མཐུས་འདིར་ཡོན་ཏན་གྱི་རྒྱུ་དཔག་ཏུ་མེད་པར་ཡང་ཀུན་ཏུ་སྣང་ངོ་། །
en: Thus, through the power of this absorption, fathomless causes of positive qualities manifest.”

source: ཆོས་འདི་དྲི་མེད་དག་དགེ་རང་བཞིན་འོད་གསལ་ཏེ། །
en: “This Dharma is immaculate, pure, virtuous, and naturally luminous.

source: ནམ་མཁའ་མཚུངས་ཤིང་མཉམ་ལ་གདོད་ནས་བྱུང་བ་མེད། །
en: It is space-like and primordially unmanifest.

source: མ་སྐྱེས་མ་བྱུང་གནས་པ་མེད་ཅིང་འགགས་པ་མེད། །
en: It is unborn, non-arising, baseless, and unceasing.

source: འདི་ནི་རྒྱལ་བའི་ཕྱག་རྒྱ་དྲི་མེད་གཡོ་བ་མེད། །
en: Thus is the unwavering and immaculate seal of the victors.

source: དེ་ཡི་རྩ་བའི་གནས་ནི་དབྱེ་བ་མེད་པའི་གཟུངས། །བྱམས་པ་དང་ནི་སྙིང་རྗེ་སྒོམ་པ་ཟུང་དུ་འབྲེལ། །
en: “This fundamental point is the indivisible dhāraṇī— The unified cultivation of love and compassion.

source: དེས་ན་འགྲོ་བ་ཀུན་གྱིས་བཀུར་ཀྱང་དགའ་བ་མེད། །
en: Even if one were served by all beings, there would be no elation.

source: བསྟི་སྟང་མ་བྱས་ཡི་འཆད་མེད་དེ་མཉམ་པའི་བློ། །
en: And when not honored, there is no loss—it is a mind of sameness.

source: དེ་ནི་མཉམ་པའི་ཆོས་ལས་ཡེ་ཤེས་སྐྱེས་གྱུར་ནས། །
en: “Wisdom arises from this quality of sameness.

source: གཏི་མུག་མུན་པ་ཐམས་ཅད་བཅོམ་སྟེ་རྨོངས་པ་མེད། །
en: It defeats the darkness of dullness and eliminates stupidity.

source: ཡེ་ཤེས་ལྡན་པ་ཡིན་གྱིས་ང་རྒྱལ་ལྡན་པ་མིན། །
en: Because one possesses wisdom, there is no pride.

source: ངེས་བསམ་མཉམ་ཆོས་ཤེས་ནས་ཤིན་ཏུ་རྣམ་པར་དག །
en: Knowing the quality of sameness with certainty, one is pure.

source: མཁས་པ་ལུས་ངག་ཡིད་ཀྱིས་ལས་ནི་གང་བྱེད་པ། །ཐམས་ཅད་ཤེས་པས་བྱས་ཏེ་འགྲོ་ལ་བདེ་བ་བྱེད། །
en: “Whatever actions of body, speech, or mind the learned perform, They bring happiness to beings with their comprehensive knowledge.

source: དེ་ལུས་རྣམ་པར་དག་པ་སེམས་ཅན་མང་པོས་མཐོང་། །རྒྱལ་བའི་ཡེ་ཤེས་རྡུལ་མེད་བླ་ན་མེད་ལ་སྨོན། །
en: Many beings perceive their pure forms And aspire to the unsurpassed and flawless wisdom of the victors.

source: དེ་ཡི་སྤྱོད་ལམ་རྟག་ཏུ་བསྡམས་ཏེ་འཁྲུལ་པ་མེད། །
en: “Their conduct is always restrained and undeluded.

source: ལྷུན་གྱིས་གྲུབ་སྟེ་ཐ་མར་མི་རྟོག་རྣམ་རྟོག་མེད། །
en: It is spontaneous and ultimately involves no thought or concept.

source: ལུས་ཀྱི་ཉེས་པ་མཐའ་ཡས་ཇི་ཙམ་གང་བརྗོད་པ། །དེ་དག་དེ་ལ་ཆད་དེ་གདོད་ནས་སྐྱེས་པ་མེད། །
en: Every physical fault that one could speak of Has for them ended and is primordially unborn.

source: དེ་ལུས་མཚན་གྱིས་བརྒྱན་ཏེ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ། །
en: “Their bodies are powerful and adorned with marks.

source: དེ་ཡི་རྐང་མཐིལ་འཇམ་ཞིང་བསོད་ནམས་རྣམས་ལས་བྱུང་། །
en: The soles of their feet are smooth, having arisen from merit.

source: དབང་པོ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པས་ལུས་མཛེས་ཀྱང་། །མཁས་པ་གཟུགས་ཀྱིས་རྒྱགས་པས་རློམ་སེམས་བྱེད་པ་མེད། །
en: Though their bodies are gorgeous, complete in all faculties, The learned do not get puffed up about their appearance and have no arrogance.

source: དམན་ཞིང་དབུལ་བས་སྡུག་བསྔལ་སེམས་ཅན་མང་པོ་གང་། །དེ་དག་ལ་ཡང་གུས་བཅས་འདུད་ཅིང་རབ་ཏུ་འདུད། །
en: “They respect, serve, and bow to many beings, Who suffer due to deprivation and poverty.

source: བདག་ནི་ཆོས་འཛིན་གྱུར་ཅིག་སྙམ་སྟེ་ང་རྒྱལ་མེད། །
en: They have no pride, wishing that they may uphold the Dharma.

source: ཆོས་མཉན་དེས་ནི་བྱང་ཆུབ་དམ་པ་ཐོབ་པར་འགྱུར། །
en: These students of the Dharma will attain sublime awakening.

source: དེ་ཡིས་རང་གི་ལུས་ཀྱི་ཆོས་ཉིད་ཤེས་ནས་ནི། །དེ་ཡི་སེམས་ཅན་ཀུན་ལུས་དེ་ལྟར་རྟོགས་པས་ན། །
en: “Knowing the nature of their own bodies, They realize the same in the bodies of all beings.

source: དེ་ནི་ཆོས་ལུས་རྡུལ་དང་བྲལ་བ་ཐོབ་འགྱུར་ཏེ། །ཟང་ཟིང་ལུས་མིན་ཉོན་མོངས་རྣམས་ལས་ཤིན་ཏུ་གྲོལ། །
en: They attain the flawless Dharma body, which is not physical, And thus they are freed from all afflictive emotions.

source: རྟག་ཏུ་ཏིང་འཛིན་སྤྱོད་ཡུལ་བསམ་གཏན་ཟས་ཅན་འགྱུར། །
en: “Eternally possessed of absorption, they are sustained by concentration.

source: གཟི་བརྗིད་ཆེན་པོ་ལ་ནི་ཟང་ཟིང་ལུས་མི་སྲིད། །
en: For these resplendent ones, physical embodiment is an impossibility.

source: སེམས་ཅན་དོན་དུ་ཁ་ཟས་ཟ་ཡི་སྟོབས་ཕྱིར་མིན། །
en: They consume food for beings’ sake, not to maintain their strength.

source: འཆི་མེད་དོན་དུ་དེ་ནི་ཆོས་ཀྱིས་སྲོག་ཀྱང་འཚོ། །
en: They sustain their lives with Dharma for the sake of deathlessness.

source: འཕགས་པ་ཚུལ་ནི་རྟག་བསྲུང་ཤིན་ཏུ་རབ་ཏུ་ཞི། །
en: “Always maintaining the noble way, they are at utter peace.

source: འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ཤིན་ཏུ་རྣམ་པར་ཕྱེ། །
en: They separate themselves from attachment, aggression, and dullness.

source: བསླབ་པ་སྦེད་པར་གནས་ཤིང་རྒོད་མེད་འཐུན་པར་བྱེད། །
en: They keep their trainings hidden, and are calm and harmonious.

source: མཁས་པ་བདག་གཏོང་བྱེད་ཀྱི་སྡིག་པ་བྱེད་མ་ཡིན། །
en: The learned ones give themselves away and do no evil.

source: རྫུ་འཕྲུལ་གྱིས་ནི་བྱེ་བ་ཕྲག་མང་ཞིང་སོང་ནས། །
en: “Through miraculous power, they travel to trillions of realms.

source: སེམས་ཅན་ལུས་དང་འཐུན་པར་བྱས་ཏེ་ཆོས་ཀྱང་སྟོན། །
en: There they teach the Dharma, acting in accord with beings’ bodies.

source: འགྲོ་བའི་གཟུགས་དང་མཚན་དང་རྟགས་ནི་ཅི་འདྲ་བ། །དེ་ཡི་ལུས་ནི་དེ་ལྟ་བུ་དང་མཚུངས་པར་འགྱུར། །
en: Their bodies take on the appearance Of the forms, marks, and characteristics that beings possess.

source: དེ་ཡི་ལུས་ལས་ཤིན་ཏུ་རྣམ་དག་འོད་བྱུང་སྟེ། །
en: “From their bodies, a very pure light springs forth.

source: དེས་ནི་ཕྱོགས་བཅུ་མཐའ་ཡས་ཞིང་རྣམས་ཁྱབ་པར་བྱེད། །
en: It pervades infinite fields throughout the ten directions.

source: དེ་ཡི་འོད་དེ་བསོད་ནམས་གཟི་ལྡན་རེག་ན་འཇམ། །སྲོག་ཆགས་ཉོན་མོངས་གདུང་བ་ཐམས་ཅད་ཞི་བར་བྱེད། །
en: This light carries the splendor of merit, and is pleasing on contact, Pacifying the torture of beings’ afflictions.

source: སེམས་དམྱལ་རྣམས་ན་སེམས་ཅན་བརྒྱ་དག་སྡུག་བསྔལ་བ། །དེ་དག་འོད་ཀྱིས་རེག་མ་ཐག་ཏུ་བདེ་བར་འགྱུར། །
en: “The suffering of thousands of beings in hell Is alleviated immediately upon contact with this light.

source: ལུས་དང་ཡིད་ཀྱང་དགའ་བར་འགྱུར་བ་རབ་ཏུ་འཐོབ། །
en: They achieve joy in body and mind,

source: དེ་ནི་སེམས་ཅན་དམྱལ་ལས་རབ་ཏུ་ཐར་བའི་རྒྱུ། །
en: And this causes their liberation from the hells.

source: འདི་དག་དང་ནི་གཞན་ཡང་ལུས་ལས་ཡོངས་སྦྱངས་པ། །མཐའ་ཡས་ལུས་རྣམས་ཡེ་ཤེས་ཀྱིས་ནི་རྣམ་པར་ཕྱེ། །
en: “In these and other ways their physical actions are refined. These limitless bodies are empowered by wisdom.

source: མཁས་པ་ཤིན་ཏུ་དུལ་བ་སངས་རྒྱས་མཛད་པ་བྱེད། །
en: These gentle and wise beings enact buddha activities.

source: རྡུལ་བྲལ་རྣམས་ཀྱི་ལུས་ཀྱི་ལས་འདི་དེ་འདྲའོ། །
en: Their flawless physical actions are like this.

source: དེ་དག་ཚིག་ནི་རྣམ་དག་སྒྲ་སྙན་ཡིད་དུ་འོང་། །དེས་ནི་ལྷ་དང་ལྷ་མིན་འགྲོ་ཀུན་ཚིམ་པར་བྱེད། །
en: “Their words are pure and their voices pleasing to hear, Satisfying all beings—divine and otherwise.

source: དེ་སྨྲ་བ་ན་འཆད་པ་དོན་མེད་མི་འགྱུར་ཏེ། །ཐེག་པ་བདུད་རྩི་འདུས་བྱས་མིན་འདིར་ངེས་པར་འབྱུང་། །
en: When they speak, their explanations always carry meaning, And the unconditioned nectar of this vehicle emerges.

source: དག་ལས་ངག་གིས་ཉེས་པ་ངེས་མང་གང་ཡོད་པ། །དེ་དག་དེ་ཡི་བསོད་ནམས་དག་པས་ཀུན་ཏུ་ཆད། །
en: “All the many faults related to the voice Are disrupted by their pure merit.

source: སྐད་རྣམས་མཚུངས་ཤིང་སྒྲ་མཚུངས་གྱུར་པས་སེམས་ཅན་རྣམས། །སྒྲ་དང་ངག་ལས་ཇི་སྙེད་ཀུན་གྱིས་ཚིམ་པར་བྱེད། །
en: Because for them all languages and sounds are the same, They satisfy beings with all their verbal statements.

source: !དེ་ཡི་ངག་ནི་ཕྱད་ཅིང་མཉམ་ལ་ཡང་དག་མིན། །
en: “Their speech is constant, even, and true.

source: ཡང་དག་ལུང་སྟོན་བསྒྲིབས་པ་མེད་ཅིང་མཉམ་པར་བཞག །
en: Their proclamations are unobscured, and they rest in equipoise.

source: ཚིག་གང་སྨྲས་པ་དེ་ཡང་དེ་བཞིན་འགྱུར་བ་སྟེ། །
en: Everything that they say later comes to pass.

source: བདེན་པའི་རྗེས་སུ་འབྲང་བའི་ཤེས་པས་ཤིན་ཏུ་དག །
en: With their knowledge that accords with truth they are pure.

source: ཉོན་མོངས་ཐ་བ་མེད་ཅིང་འདོད་ཆགས་རབ་ཏུ་ཞི། །
en: “They have no afflictions and they have pacified desire.

source: ཚར་བཅད་ཡོན་ཏན་སྨྲ་ཞིང་སྐྱོན་ལས་ཤིན་ཏུ་གྲོལ། །
en: Having eliminated this, their voice conveys qualities and they are free of faults.

source: ཟབ་ཅིང་གཏིང་དཔག་དཀའ་ལ་ཤིན་ཏུ་ཆད་པ་སྟེ། །དོན་རྣམས་བྱེད་ཅིང་ཞིང་སྟོང་དག་ཏུ་ཁྱབ་པར་བྱེད། །
en: Vast, hard to fathom, and utterly terminated, They benefit others and pervade thousands of buddha realms.

source: རྟོག་པ་མེད་པར་ཚིག་འདི་རབ་ཏུ་སྨྲ་བར་བྱེད། །
en: “They speak words that are not based in concepts.

source: རང་གི་ངང་གིས་བྱུང་ནས་ཇི་ལྟར་ཐར་འགྱུར་སྨྲ། །
en: As a natural expression, they declare how freedom can be found.

source: རྟག་ཏུ་ས་བཞིན་སེམས་ཅན་དབང་པོ་ཚིམ་པར་བྱེད། །
en: Like the earth itself, they always satisfy the faculties of beings.

source: རྣམ་པར་སྤྱོད་བྱེད་ཚིག་མཆོག་འདིས་ནི་ཤེས་པས་བྱས། །
en: Their supreme statements they make are informed by knowledge.

source: དེ་ཡི་ཡིད་ལས་རྟག་ཏུ་བསྒྲིབས་མེད་ལེགས་པར་བྱས། །
en: “Obscurations have been permanently removed from their minds.

source: སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་འགྲོ་བའི་སེམས་རྣམས་ཤེས། །
en: They know all the minds of beings in a single moment of mind.

source: དེ་ནི་གཡེང་མེད་ཏིང་ངེ་འཛིན་ལས་ཉམས་པ་མེད། །
en: They do not regress from undistracted absorption.

source: ཁྱུ་མཆོག་དེ་ཡི་རྒྱུ་བ་བདུད་ཀྱིས་ཤེས་མ་ཡིན། །
en: The minds of these perfect leaders are unknown to māras.

source: དེ་ཡི་སེམས་ཡིད་རྣམ་རྟོག་ཤིན་ཏུ་ཟབ་པ་སྟེ། །རང་རྒྱལ་རྣམས་དང་ཉན་ཐོས་ཀུན་གྱིས་ཤེས་པར་དཀའ། །
en: “Their minds, cognitions, and thoughts are deeply profound Such that solitary buddhas and hearers would find them difficult to fathom.

source: བདག་དང་གཞན་ལ་རྣམ་པར་མི་འཚེ་རྗེས་ཆགས་མེད། །
en: They neither harm themselves nor others, and inspire no attachment.

source: ཁོང་ཁྲོ་མེད་ཅིང་ཁེངས་པ་མེད་ཅིང་མཉམ་པའི་བློ། །
en: They have even minds free of anger or arrogance.

source: མཁས་པ་དེ་ནི་འགྲོ་ལ་རིགས་བཞིན་ཤེས་པ་འཇུག །
en: “These wise ones engage with others in harmony with their class.

source: ཚོར་བ་མ་ཡིན་སེམས་པ་མ་ཡིན་རྣམ་རྟོག་མིན། །
en: Yet they do so without feeling, intention, or thought.

source: འཆི་མེད་དོན་དུ་བྱང་ཆུབ་གནས་སུ་ཕྱིན་བར་དུ། །ཚོར་བ་འགོག་ལ་བདེ་བར་རྟོགས་པ་བྱེད་མ་ཡིན། །
en: While reaching the abode of awakening for the sake of deathlessness, They do not block feelings nor do they dwell conceptually on pleasure.

source: ཆོས་བཅུ་དེ་དག་གང་ལ་རྟག་ཏུ་དག་གྱུར་པ། །ཁྱུ་མཆོག་དེ་ལ་ཏིང་འཛིན་འདི་ནི་མངོན་དུ་གྱུར། །
en: “Wherever these ten qualities have been permanently purified, A perfect leader manifests this absorption.

source: གང་ཚེ་འཇུག་པའི་སྤྱོད་པ་རྣམ་པར་སྦྱངས་གྱུར་པ། །དཀར་པོའི་ལམ་རྣམས་ཀུན་གྱིས་འཕགས་ཤིང་ཡོངས་སུ་དག །
en: When the conduct of engagement is practiced, All are ennobled and purified by the paths of goodness.

source: ས་རྣམས་ཇི་བཞིན་ཕ་རོལ་ཕྱིན་པ་ཀུན་སྦྱངས་ཏེ། །དགེ་བ་རྒྱ་ཆེན་ཐམས་ཅད་ཀྱིས་ནི་མངོན་པར་འཕགས། །
en: “The perfections are accomplished on their corresponding levels, Leaving one ennobled by the vastness of virtue.

source: བསོད་ནམས་འབྲས་བུས་མཚན་ཀུན་ཤིན་ཏུ་རྣམ་པར་དག །
en: Merit results in the purification of the major marks.

source: སྤོབས་པས་ཀྱང་ནི་གཟུངས་རྣམས་མཐར་ཐུག་མེད་པར་འགྱུར། །
en: With eloquence the dhāraṇīs become endless.

source: མཁས་པ་རྟག་ཏུ་ཐོས་པའི་ཆོས་རྣམས་སྒྲུབ་པར་གནས། །
en: “The learned always accomplish the teachings they have heard.

source: མཁས་པ་རྟག་ཏུ་དྲན་ལ་མཉམ་བཞག་འཁྲུལ་པ་མེད། །
en: The mindful equipoise of learned beings is never confused.

source: དེ་ལ་ཀུན་ནས་ལྡང་བ་རྣམས་དང་འཁྲུལ་པ་ནི། །ཕྲ་རབ་མཐོང་བར་མི་ནུས་སྒྲིབ་ཀུན་རྣམ་པར་དག །
en: In them no subtle karmic ripening or confusion can be seen. Instead, all obscurations are purified.

source: བྱང་ཆུབ་ཕྱོགས་ཆོས་རྒྱ་ཆེན་མཐའ་ཡས་གང་ཡིན་པ། །ཐམས་ཅད་དེ་ཡི་བག་ཡོད་པ་ལ་འདུ་བར་འགྱུར། །
en: “All the vast and infinite factors of awakening Are present in these conscientious ones.

source: ཞི་གནས་མཐར་གྱུར་ལྷག་མཐོང་གིས་ནི་རྟག་ཏུ་ཤེས། །
en: With perfect tranquility, they always understand due to special insight.

source: ས་བཅུ་པོ་ནི་གནོན་པར་འགྱུར་ཞིང་ཆགས་པ་མེད། །
en: Thus they reach the ten levels and eliminate attachment.

source: བྱང་ཆུབ་སྙིང་པོ་སྤྱད་ཕྱིར་ཤིན་ཏུ་རྫོགས་པར་སྨྲ། །
en: “They speak perfectly because they experience the heart of awakening.

source: དེ་ནི་མི་དགེ་ཀུན་སྤངས་དགྲ་ལས་རྒྱལ་བར་འགྱུར། །
en: Eliminating all nonvirtue, they will achieve victory over the enemy.

source: དགེ་བའི་ཆོས་རྣམས་ཀུན་གྱིས་འཕགས་པ་རི་རབ་བཞིན། །དེ་ནི་བསམ་ཡས་དྲི་མེད་འོད་འདི་རབ་ཏུ་ཐོབ། །
en: Due to their virtuous qualities, they are elevated like Mount Meru, And attain this unfathomable and immaculate light.

source: ཏིང་འཛིན་འདི་ཐོབ་མཁས་དེ་བསོད་ནམས་བྱས་ནས་ནི། །ཡོངས་སུ་དག་པའི་ཆོས་མཆོག་ཉི་ཤུ་རབ་ཏུ་འཐོབ། །
en: “Attaining this absorption, these learned ones act meritoriously, And attain the twenty supreme qualities of purification.

source: དེ་དག་གི་ནི་འགྲོ་བ་ཀུན་ནའང་ཉི་བཞིན་ལྷང་། །རྒྱལ་བའི་ཡེ་ཤེས་བླ་ན་མེད་པའི་བྱང་ཆུབ་རེག །
en: Like the sun, they brighten the lives of all beings, And reach the victor’s wisdom—unsurpassed awakening.

source: ཤིང་གི་དྲུང་དུ་ཤུགས་བརྒྱད་བསམ་དུ་མེད་ཐོབ་ནས། །དེ་དག་གིས་ནི་ཞིང་བརྒྱ་དག་ན་འགྲོ་དོན་བྱེད། །
en: “Before the tree, they achieve the inconceivable eight strengths And act for the welfare of beings in thousands of realms.

source: སངས་རྒྱས་མི་འཇིགས་བྱིན་ཞིང་འགྲོ་བའི་དཔའ་བོ་དེ། །
en: They bestow the fearlessness of the buddhas and are the heroes of beings.

source: བདུད་རྣམས་བཏུལ་བར་བྱས་ནས་བྱང་ཆུབ་མཆོག་ལ་རེག །
en: Taming the māras, they reach supreme awakening.

source: !རྒྱལ་བའི་ཕྱག་རྒྱ་སྤྱངས་པ་ཐོབ་པར་གྱུར་ནས་ནི། །ཡོན་ཏན་འདི་འདྲ་དེ་ཀུན་བསམ་གྱིས་མི་ཁྱབ་འགྱུར། །
en: “Having completed their training in the victors’ seal, All of these qualities reach an unfathomable extent.

source: དེ་ལྟ་བས་ན་མི་གང་ཡོན་ཏན་ཕྲེང་འདོད་པ། །དེ་མྱུར་བྱང་ཆུབ་སེམས་ལ་བརྩོན་འགྲུས་བརྟན་པ་བསྐྱེད། །
en: Thus, those who yearn for such a garland of qualities Should quickly become diligent in maintaining the mind of awakening.”

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འདོད་པས་རྙོག་པ་མེད་པའི་སེམས་དང་། འཁྲུགས་པ་མེད་པའི་སེམས་ཀྱིས་ཤིན་ཏུ་དཀར་ཞིང་དྲི་མ་མེད་པའི་བློ་དང་ལྡན་པར་བྱའོ། །
en: “Therefore, Sāgaramati, bodhisattva great beings who yearn to attain this pristine and immaculate absorption seal should ensure their minds are pristine and immaculate through maintaining a limpid and undisturbed mind.

source: དེ་ལ་རྙོག་པ་མེད་པའི་སེམས་དེ་ནི་གང་སེམས་རང་བཞིན་གྱིས་འོད་གསལ་བ་ལ་གློ་བུར་གྱིས་ཉོན་མོངས་པ་རྣམས་ཀྱི་སྐབས་མེད་པ་དང་།
en: A limpid mind is the mind that has a luminous nature, wherein there is no opportunity for adventitious afflictive emotions to occur.

source: འོད་གསལ་བའི་ཆོས་མི་འགྱུར་བ་ཉིད་དང་།
en: Its quality of luminosity is unchanging.

source: ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་ཀུན་ཏུ་མི་འབྱུང་བ་དང་།
en: It is completely free from mental engagement.

source: འདོད་ཆགས་དང་བྲལ་ཏེ་རྡུལ་མེད་པ་དང་།
en: It is free of attachment and thus unpolluted.

source: ཞེ་སྡང་དང་བྲལ་ཏེ་རྟོག་པ་མེད་པ་དང་།
en: It is free of aggression and nonconceptual.

source: གཏི་མུག་དང་བྲལ་ཏེ་མུན་པ་མེད་པ་དང་།
en: It is free of dullness and free of darkness.

source: དག་པ་དང་། རྣམ་པར་དག་པ་དང་། ཤིན་ཏུ་དྲི་མ་མེད་པ་དང་། རྣམ་པར་གྲོལ་བ་ལས་བྱུང་བ་དང་།
en: It arises from a state that is pure, pristine, immaculate, and liberated.

source: རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ཏེ། དེ་བཞིན་ཉིད་དང་མཉམ་པའི་རྗེས་སུ་ཞུགས་པ་དང་།
en: “In the same way it is liberated, so are all phenomena—they are the same as suchness.

source: རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ཏེ་ཆོས་ཀྱི་དབྱིངས་དང་མཉམ་པའི་རྗེས་སུ་ཞུགས་པ་དང་།
en: In the same way it is liberated, so are all phenomena—they are the same as the realm of phenomena.

source: རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ཏེ། ཡང་དག་པའི་མཐའ་དང་མཉམ་པའི་རྗེས་སུ་ཞུགས་པ་དང་།
en: In the same way it is liberated, so are all phenomena—they are the same as the limit of reality.

source: རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ཏེ། སྟོང་པ་ཉིད་དུ་མཉམ་པའི་རྗེས་སུ་ཞུགས་ཤིང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། མ་སྐྱེས་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པར་མཉམ་པའི་རྗེས་སུ་ཞུགས་པ་དང་།
en: In the same way it is liberated, so are all phenomena—they are the same as emptiness, signlessness, wishlessness, the unconditioned, the non-arising, the unborn, and the unceasing.

source: རྣམ་པར་གྲོལ་བ་ཇི་ལྟ་བར་འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་དེ་བཞིན་ཏེ། དེ་བཞིན་དུ་འདུས་མ་བྱས་ཀྱི་ཆོས་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པའི་རྗེས་སུ་ཞུགས་པ་སྟེ།
en: In the same way it is liberated, so are all conditioned phenomena—they are the same as the sameness of unconditioned phenomena.

source: གང་འདི་ལ་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་འགྲོ་བའི་ཡེ་ཤེས་གདེགས་པ་དང་གཞག་པ་མེད་པ་འདི་ནི་རྙོག་པ་མེད་པའི་སེམས་ཞེས་བྱའོ། །
en: “This wisdom that accords with sameness, and that does not pick up or put down anything, is called the limpid mind.

source: གང་གི་ཚེ་ཆོས་འདི་དག་སེམས་ཅན་གཞན་དང་། གང་ཟག་གཞན་དག་ལ་སྟོན་ཀྱང་བདག་དང་གཞན་དུ་རྣམ་པར་འཁྲུགས་པ་མེད་པ་འདི་ནི་རྙོག་པ་མེད་པའི་སེམས་སོ། །
en: Even when this teaching is introduced to other beings and people, there is no disturbance in terms of either self or other. Such is the limpid mind.

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་རྙོག་པ་མེད་ཅིང་འཁྲུགས་པ་མེད་པར་གྱུར་པ་དེའི་ཚེ་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་འདི་རབ་ཏུ་འཐོབ་བོ། །
en: When bodhisattvas’ minds are limpid and undisturbed, they will attain the pristine and immaculate absorption seal.”

source: བློ་གྲོས་རྒྱ་མཚོས་གསོལ་པ།
en: exclaimed Sāgaramati.

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་ཟབ་ལགས་སོ། །
en: “Blessed One, this absorption is profound!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བློ་གྲོས་རྒྱ་མཚོ་གཏིང་མི་དམིགས་པའི་ཕྱིར་རོ། །
en: “Yes, Sāgaramati,” answered the Blessed One, “because its depths cannot be seen.”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་བལྟ་དཀའ་བ་ལགས་སོ། །
en: “Blessed One, this absorption is hard to see!”

source: གཉིས་དང་བྲལ་བའི་ཕྱིར་རོ། །
en: “Yes, because it is free from duality.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་རྟོགས་པར་དཀའ་བ་ལགས་སོ། །
en: “Blessed One, this absorption is difficult to realize!”

source: ང་རྒྱལ་གྱིས་ལྷག་པར་སེམས་པ་ལྷག་པར་མི་ཕྱེད་པའི་ཕྱིར་རོ། །
en: “Yes, because it cannot be approached through pride and self-aggrandizing.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་རྣམ་པར་འཚལ་བར་དཀའ་བ་ལགས་སོ། །
en: “Blessed One, this absorption is difficult to understand!”

source: རྣམ་པར་ཤེས་པ་དང་ཡེ་ཤེས་མཉམ་པ་ཉིད་དུ་རྟོགས་པའི་ཕྱིར་རོ། །
en: “Yes, because it is realized as the sameness of consciousness and wisdom.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་གསལ་བ་ལགས་སོ། །
en: “Blessed One, this absorption is lucid!”

source: སྒྲིབ་པ་མེད་པའི་རྣམ་པར་ཐར་པ་རབ་ཏུ་ཐོབ་པའི་ཕྱིར་རོ། །
en: “Yes, because it is the attainment of unobscured liberation.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་ཤིན་ཏུ་ཕྲ་བ་ལགས་སོ། །
en: “Blessed One, this absorption is so subtle!”

source: དཔེ་རྣམ་པར་གཞག་པ་དང་བྲལ་བའི་ཕྱིར་རོ། །
en: “Yes, because it cannot be analogized.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་སྙིང་པོ་ལགས་སོ། །
en: “Blessed One, this absorption is essential!”

source: རྡོ་རྗེ་ལྟ་བུའི་ཡེ་ཤེས་རབ་ཏུ་ཐོབ་པའི་ཕྱིར་རོ། །
en: “Yes, because it attains the vajra-like wisdom.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་དབྱེར་མ་མཆིས་པ་ལགས་སོ། །
en: “Blessed One, this absorption is indivisible!”

source: སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་དབྱེར་མེད་པའི་ཕྱིར་རོ། །
en: “Yes, because the past and the future are indivisible.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་ཆགས་པ་མ་མཆིས་པ་ལགས་སོ། །
en: “Blessed One, this absorption is unobstructed!”

source: ཆགས་པའི་ལམ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པའི་ཕྱིར་རོ། །
en: “Yes, because it transcends all the paths of attachment.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་སྣང་བར་གྱུར་པ་ལགས་སོ། །
en: “Blessed One, this absorption is so illuminating!”

source: གཏི་མུག་གི་མུན་པ་དང་བྲལ་བའི་ཕྱིར་རོ། །
en: “Yes, because it is free of the darkness of dullness.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་རྣམ་པར་དག་པ་ལགས་སོ། །
en: “Blessed One, this absorption is so pure!”

source: ཤིན་ཏུ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་རོ། །
en: “Yes, because it is devoid of affliction.”
